#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
day = int(input('Введите чцифру, обозначающую день недели : '))
print(day > 5 and day <= 7)